Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.Name
The Name class represents the name filter expression.

Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.Name.#ctor
Initializes a new instance of the Name class.